const times = [
  '', '8:00-9:35', '9:50-11:25', '11:40-13:15', '13:45-15:20', '15:35-17:10'
]

const createLesson = (name, time, type, office, teacher) => {
  return [
    times[time],
    `${name} ${type}`,
    teacher,
    office
  ]
};

const monday = {
  'name' : 'Понедельник',
  '1' : [
    createLesson('Физическая кулькура и спорт', 1, '', '', ''),
    createLesson('История географии', 2, 'Лек.', '15-347', 'Вдовина Э.Л.'),
    createLesson('История географии', 3, 'Прак.', '15-347', 'Вдовина Э.Л.')
  ],
  '2' : [
    createLesson('Физическая кулькура и спорт', 1, '', '', ''),
    createLesson('Кураторский час', 2, '', '15-347', ''),
    createLesson('История географии', 3, 'Прак.', '15-347', 'Вдовина Э.Л.')
  ],
};

const tuesday = {
  'name' : 'Вторник',
  '1' : [
    createLesson('История России', 2, 'Лек.', '11-343', 'Кузьмина Т.Н.'),
    createLesson('Геология', 3, 'Лаб.', '15-356', 'Алексеева Н.С.'),
    createLesson('Опасности техногенного характера и защита от них', 4, 'Лаб.', '15-343', 'Филатова О.М.'),
  ],
  '2' : [
    createLesson('История России', 2, 'Лек.', '11-343', 'Кузьмина Т.Н.'),
    createLesson('Геология', 3, 'Лаб.', '15-356', 'Алексеева Н.С.'),
    createLesson('Опасности техногенного характера и защита от них', 4, 'Лаб.', '15-343', 'Филатова О.М.')
  ],
};

const wednesday = {
  'name' : 'Cреда',
  '1' : [
    createLesson('Ин. язык', 2, 'Лаб.', '15-348', 'Шепелева Е.В.'),
    createLesson('Основы российской государственности', 3, 'Прак.', '15-347', 'Ульяов А.Е.'),
    createLesson('Общее землеведение', 4, 'Лек.', '15-347', 'Артемова С.Н.'),
    createLesson('Общее землеведение', 5, 'Лаб.', '15-352', 'Артемова С.Н.')
  ],
  '2' : [
    createLesson('Ин. язык', 2, 'Лаб.', '15-348', 'Шепелева Е.В.'),
    createLesson('Основы российской государственности', 3, 'Прак.', '15-347', 'Ульяов А.Е.'),
    createLesson('Картография с основами типографии', 4, 'Лек.', '15-347', 'Качалина Ю.С.'),
    createLesson('Картография', 5, 'Лаб.', '15-348', 'Качалина Ю.С.')
  ],
};

const thursday = {
  'name' : 'Четверг',
  '1' : [
    createLesson('Возрастная анатомия, физиалогия и гигиена', 1, 'Лек.', '11-343', 'Миронова Е.В.'),
    createLesson('Элективные дисциплины по физической кулькуре и спорту', 2, '', '', '')
  ],
  '2' : [
    createLesson('Основы российской государственности', 1, 'Лек.', '15-343', 'Ульяов А.Е.'),
    createLesson('Элективные дисциплины по физической кулькуре и спорту', 2, '', '', ''),
    createLesson('Экология', 3, 'Прак.', '15-240', 'Закс С.С.'),

  ],
};

const friday = {
  'name' : 'Пятница',
  '1' : [
    createLesson('Возрастная анатомия, физиалогия и гигиена', 1, 'Лек.', '11-343', 'Миронова Е.В.'),
    createLesson('История России', 2, 'Прак.', '15-345', 'Кузьмина Т.Н.'),
    createLesson('Геология', 3, 'Лек.', '15-347', 'Алексеева Н.С.'),
    createLesson('Экология', 4, 'Лек.', '15-240', 'Закс С.С.')
  ],
  '2' : [
    createLesson('История России', 2, 'Прак.', '15-345', 'Кузьмина Т.Н.'),
    createLesson('Опасности техногенного характера и защита от них', 3, 'Лек.', '15-343', 'Филатова О.М.')
  ],
};

const saturday = {
  'name' : 'Суббота',
  '1' : [
    createLesson('Современные информационные технологии', 1, 'Лаб.', '13-38', 'Болотский А.В.'),
    createLesson('Современные информационные технологии', 2, 'Лек.', '11-343', 'Болотский А.В.')
  ],
  '2' : [

  ],
};

const sunday = {
  'name' : 'Воскресенье',
  '1' : [
  ],
  '2' : [
  ],
};


const data = [
  sunday,
  monday,
  tuesday,
  wednesday,
  thursday,
  friday,
  saturday
]

console.log(data)